OpenFOAM/Rayleigh_Taylor_instability/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;
rx  160;
ry  340;
vertices
(
    (0 0 0)
    (0.5 0 0)
    (0.5 1.5 0)
    (0 1.5 0)
    (0 0 0.1)
    (0.5 0 0.1)
    (0.5 1.5 0.1)
    (0 1.5 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($rx $ry 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (3 7 6 2)
            (1 5 4 0)
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
mergePatchPairs
(
);


// ************************************************************************* //
